<?php
require 'address.php';

// 解析包含用户信息的字符串
$string = '深圳市龙华区龙华街道1980科技文化产业园3栋317    张三    13800138000 518000 120113196808214821';
$r = Address::smart($string);
print_r($r);

// 解析不包含用户信息的字符串
$string = '吉林省长春市朝阳区开运街领秀朝阳小区333弄8号502';
$r = Address::smart($string, $user = false);
print_r($r);

// 测试
$test = array(
    '北京市东城区宵云路36号国航大厦一层',
    '甘肃省东乡族自治县布楞沟村1号',
    '成都市双流区宵云路36号国航大厦一层',
    '内蒙古自治区乌兰察布市公安局交警支队车管所',
    '长春市朝阳区宵云路36号国航大厦一层',
    '成都市高新区天府软件园B区科技大楼',
    '双流区郑通路社保局区52050号',
    '岳市岳阳楼区南湖求索路碧灏花园A座1101',
    '四川省 凉山州美姑县东方网肖小区18号院',
    '重庆攀枝花市东区机场路3中学校',
    '渝北区渝北中学51200街道地址',
    '13566892356天津天津市红桥区水木天成1区临湾路9-3-1101',
    '苏州市昆山市青阳北路时代名苑20号311室',
    '崇州市崇阳镇金鸡万人小区兴盛路105-107',
    '四平市双辽市辽北街道',
    '梧州市奥奇丽路10-9号A幢地层（礼迅贸易有限公司）卢丽丽',
    '江西省抚州市东乡区孝岗镇恒安东路125号1栋3单元502室 13511112222 吴刚',
    '清远市清城区石角镇美林湖大东路口佰仹公司 郑万顺 15345785872',
);

foreach ($test as $key => $v) {
    $r = Address::smart($v, $user = false);
    print_r($r);
}
